app/controllers/products_controller.rb

  def create
    @product = Product.new(product_params)
    @product.user_id = current_user.id
    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("code", "name", "price", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["code", "JMJ64C"], ["name", "Ps4"], ["price", "299.0"], ["user_id", 2], ["created_at", "2017-05-18 16:04:14.296044"], ["updated_at", "2017-05-18 16:04:14.296044"]]