app/controllers/sales_controller.rb

  def index
    @sales = Sale.all
---
SELECT "sales".* FROM "sales"

  def report
    @report = Sale.all
---
SELECT "sales".* FROM "sales"

  def approve
    @sale.update(approved: true)
---
UPDATE "sales" SET "approved" = $1, "updated_at" = $2 WHERE "sales"."id" = $3  [["approved", "t"], ["updated_at", "2017-05-19 00:30:12.596800"], ["id", 3]]

  def disapprove
    @sale.update(approved: false)
---
UPDATE "sales" SET "approved" = $1, "updated_at" = $2 WHERE "sales"."id" = $3  [["approved", "f"], ["updated_at", "2017-05-19 00:21:20.072402"], ["id", 3]]

  def create
    @sale = Sale.new(sale_params)
    #####################@sale_count++
    @sale.user_id = current_user.id
    @sale.total = @sale.total_all
    respond_to do |format|
      if @sale.save
---
INSERT INTO "sales" ("name", "total", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Hamza"], ["total", "299.0"], ["user_id", 2], ["created_at", "2017-05-18 16:04:46.413617"], ["updated_at", "2017-05-18 16:04:46.413617"]]

  def destroy
    @sale.destroy
---
DELETE FROM "sales" WHERE "sales"."id" = ?  [["id", 1]]

  def set_sale
    @sale = Sale.find(params[:id])
---
SELECT  "sales".* FROM "sales" WHERE "sales"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]