app/views/sales/_item_fields.html.erb

  <%= f.label :product, "Product" %>
  <%= f.collection_select :product_id, Product.all, :id, :name %>
---
SELECT "products".* FROM "products"