app/views/sales/report.html.erb

SELECT "sales".* FROM "sales"
SELECT COUNT(*) AS count_all, "sales"."name" AS sales_name, "sales"."total" AS sales_total FROM "sales" GROUP BY "sales"."name", "sales"."total"
---

<%= bar_chart Sale.group(:name).group(:total).count %>