app/views/sales/show.html.erb

  <tbody>
   <% @sale.items.each do |item| %>
---
SELECT "items".* FROM "items" WHERE "items"."sale_id" = ?  [["sale_id", 1]]